jsonCallback(
{
  "xSX": "PROJEKTY",
  "xnazwa1": "PRZYKŁADY GOTOWYCH PROJEKTÓW",
  "sto": "Wersja dokumentu:",
  "des": "<b>Aby zaimportować do WiHome Configurator'a wybrany projekt, należy:</b><p>Kliknąć <i>Zmień projekt</i><img src=\"../../wihome/index/images/pl/screen_2_1a.png\"></p><p>Wybrać <i>Foldery na dysku</i><img src=\"../../wihome/index/images/pl/screen_2_1b.png\"></p><p>Z listy <i>Szkice</i> wybrać odpowiedni projekt i kliknąć <i>Załaduj</i><img src=\"image/des3.png\"></p>",
  "description_01_1": "Aby podłączyć ikonę dotykową w trybie suwak (tryb 5) i sterować poziomem oświetlenia oraz wyświetlać wartość aktualną na ikonie należy: <ol><li>Wyjście ikony dotykowej połączyć z wejściem procentowym sterownika</li><li>Wyjście oświetlenia modułu (np. rH-D1S2) połączyć z wejściem ikony dotykowej</li><li>Wejście modułu oświetlenia (np. rH-D1S2) połączyć z wyjściem oświetlenia sterownika</li></ol><p>Przykład poprawnego połączenia:<img src=\"images/550_1_1_ok.png\"><div class=\"norma\">Częstym błędem jest łączenie wejścia ikony dotykowej w trybie \"suwak\" bezpośrednio z wyjściem sterownika oświetlenia. W przypadku gdy w ten sposób połączymy te dwa obiekty, projekt może nie działać prawidłowo, ponieważ nie odczytujemy rzeczywistego stanu z wyjścia modułu ściemniacza.<p>Poniższy przykład przedstawia błędne połączenie obiektów.</p></div><img src=\"images/550_1_1_bad.png\"></p>",
  "description_02_2": "Niepoprawne jest łączenie wyjścia sterownika oświetlenia SX 550 z wejściem procentowym sterownika SX 553.<img src=\"images/553_2_2_bad.png\">Aby prawidłowo sterować poziomem oświetlenia, należy wykorzystać przeznaczony do tego element systemu (np. ikonę dotykową). Poniżej przedstawiono przykład poprawnego połączenia:<img src=\"images/553_2_1_ok.png\">",
  "description_10_1": "<b>Założenia projektu</b><p><ul><li>Dwa sygnały wejściowe: brama zamknięta i brama otwarta</li><li>Jeden sygnał wyjściowy: brama start/stop</li></ul></p><p><b>Opis projektu</b></p><p>Jeżeli brama jest zamknięta, układ jest w spoczynku. Zerowane są multiwibratory i wejścia generatorów. Gdy brama jest w stanie pośrednim, tzn. w ruchu lub stoi w pozycji nie skrajnej, na wejście generatora T2 podana jest logiczna jedynka. Gdy upłynie połowa okresu tego generatora, opadające zbocze na jego wyjściu spowoduje wygenerowanie przez multiwibrator impulsu start/stop do sterownika bramy. Gdy brama nie zamknie się po pełnym okresie pracy generatora, ponownie zostanie wygenerowany impuls do sterownika bramy.</p><p>Analogiczna jest sekwencja sterowania, gdy brama stoi otwarta. Zastosowano dwa generatory, aby można było określić różne czasy dla stanu zatrzymania bramy pośrodku i bramy otwartej. Czas T2 powinien być kilka sekund dłuższy niż dwukrotność czasu ruchu bramy. Czas T1 trzeba ustawić na podwójny czas, po jakim brama ma się sama zamknąć od chwili jej otwarcia. Zastosowanie generatorów zamiast multiwibratora monostabilnego likwiduje stan zawieszenia się układu, gdyby np. proces zamykania został przerwany poprzez zablokowanie fotokomórki.</p>",
  "description_1_1": "Projekt zakłada automatyczne podlewanie ogrodu po spełnieniu następujących warunków:<ul><li>Przez ostatnie 24h nie było opadu</li><li>Przez ostatnie 24h temperatura powietrza nie spadła poniżej 18°C</li><li>Na jutro nie są prognozowane opady</li><li>Podlewanie odbywa się w nocy przez 10 minut</li><li>Po wykryciu obecności podlewanie zostaje wstrzymane na 15 minut</li></ul>",
  "description_11_1": "<b>Założenia projektu</b><p>Projekt służy do zarządzania oświetleniem w ogrodzie:<ul><li>Światło automatycznie włącza się po godzinie 12:00, gdy jest \"bardzo ciemno\"</li><li>Światło gaśnie po godzinie 22:00</li><li>Światło opcjonalnie automatycznie włącza się po godzinie 6:00, gdy jest \"bardzo ciemno\"</li><li>Światło załączyć/wyłączyć można ręcznie za pomocą panelu dotykowego</li></ul></p><b>Opis projektu</b><p>Aby skonfigurować odpowiednie czasy załączania/wyłączania oświetlenia, należy użyć <i>Ustawienia użytkownika</i> elementów SX 850. Poziom natężenia oświetlenia, przy którym ma się załączyć światło, konfiguruje się w <i>Ustawienia użytkownika</i> elementu SX 559. Dzięki zastosowaniu przełącznika ostatniej zmiany możliwe jest zarządzanie oświetleniem za pomocą panelu dotykowego. Opcjonalne załączenie światła po godzinie 6:00 w zależności od warunków natężenia oświetlenia następuje po wybraniu ikony SX 718 na panelu dotykowym.</p>",
  "description_1_2": "<p>Odczyty ze sterownika prognozy pogody SX 555 porównywane są przy użyciu komparatora cyfrowego SX 835 z odpowiednimi wartościami, aby uzyskać informację czy aktualnie nie ma opadu oraz czy na jutro nie są prognozowane opady.</p><p>Jeżeli aktualnie nie ma opadu, sygnał uruchamia generator impulsów SX 856, który podłączony jest do licznika SX 825. Impulsy generowane są co 20 minut, a maksymalna wartość licznika ustawiona jest na 72. W ten sposób odmierzany jest czas 24h i po osiągnięciu tej wartości licznik wystawia stan logiczny '1' na wyjściu \"Wartość maksymalna\".</p><p>Analogicznie odbywa się odmierzanie czasu, kiedy temperatura przekracza 18°C. Pomiaru temperatury dokonuje czujnik rH-P1T1 i wartość trafia do komparatora SX 844.</p><p>Kolejnym warunkiem uruchomienia zraszacza jest odpowiedni poziom oświetlenia słonecznego. Informację tę uzyskujemy z odpowiedniego wyjścia obiektu SX 512 Serwer znajdującego się w zakładce <i>System</i>. Wartość '0' odpowiada natężeniu oświetlenia \"bardzo ciemno\". Dekoder SX 832 po otrzymaniu '0' wystawia logiczne '1' na odpowiednim wyjściu.</p><p>Jeżeli spełnione są powyższe warunki oraz na jutro nie ma prognozowanych opadów, bramka AND otrzyma logiczne '1' na wszystkie wejścia i na wyjściu wygeneruje sygnał do uruchomienia zraszacza (tutaj realizowany modułem rH-R1S1).</p><p>Sygnał ten przechodzi jeszcze przez klucz logiczny 805, który w przypadku detekcji ruchu wyłączy zraszacz na okres 15 minut od ostatniej detekcji ruchu.</p><p>Czas podlewania mierzony jest układem generator impulsu+licznik.",
  "description_2_1": "Projekt służy do zarządzania dwoma obwodami lamp:<ul><li>Załączanie i wyłączanie obwodów lamp osobno</li><li>Załączanie i wyłączanie wszystkich obwodów lamp</li><li>Ustawianie poziomu oświetlenia dla wybranego obwodu lamp</li><li>Ustawianie poziomu oświetlenia dla wszystkich obwodów lamp</li></ul>",
  "description_2_2": "W projekcie wykorzystano dwa moduły rH-D1S2 do podłączenia dwóch obwodów lamp. Sterowanie lampami realizowane jest za pomocą panelu dotykowego. <p>Aby załączyć obwód 1 lub 2, należy kliknąć ikonę dotykową SX 719 załącz-wyłącz, Podpisaną odpowiednio \"Obwód 1\", \"Obwód 2\".</p> <p> Aby regulować poziomem oświetlenia należy użyć przycisków dotykowych SX 710 &mdash; przycisk dotykowy żarówka w trybie 5.</p><p>Wyjścia ze sterowników oświetlenia SX 550 dla obwodów 1 i 2 przekazywana są niezależnie na wejścia A przełączników ostatniej zmiany SX 848.</p> <p>Wyjście ze wspólnego sterownika oświetlenia SX 550 przekazywane jest równolegle na wejścia B obu elementów SX 848.</p>",
  "description_3_1": "<p>Projekt przedstawia sterowanie alarmem i roletą:</p><p><ul><li>Uzbrajanie oraz rozbrajanie przez panel mobilny</li><li>Po uzbrojeniu alarmu roleta zjeżdża na sam dół</li><li>Po rozbrojeniu alarmu roleta się otwiera</li><li>Możliwość sterowania roletą z osobnego panelu niezależnie od stanu alarmu<li>Możliwość sterowania roletą przy użyciu przycisków podłączonych do modułu rH-TSR1S2</li></ul>",
  "description_3_2": "<p>Uzbrajanie alarmu odbywa się za pomocą panelu dotykowego. Domyślne hasło to 1234, jest ono ustawione w <i>Ustawienia użytkownika</i> elementu SX 829 &mdash; zamek cyfrowy. Do obsługi rolety służy moduł rH-TSR1S2 połączony ze sterownikiem SX 760. Sterowanie odbywać się może przy użyciu panelu dotykowego lub przyciskami podłączonymi do styków modułu rH-TSR1S2.</p><p>W <i>Ustawienia instalatora</i> zdefiniowane jest zachowanie rolety po uzbrojeniu oraz rozbrojeniu alarmu. Domyślnie po uzbrojeniu roleta zjeżdża na sam dół, po rozbrojeniu &mdash; roleta się otwiera. W <i>Ustawienia instalatora</i> możliwe jest również ustalenie zachowania rolety po wtargnięciu &mdash; domyślnie roleta nie zmieni swojego położenia.</p><p>Na projekcie znajduje się czujnik ruchu rH-P1 w trybie alarm. Czujnik współpracuje w sposób niejawny (bez podłączenia) ze sterownikiem alarmu</p><p><b>UWAGA:</b><br>Należy pamiętać o zastosowaniu UPS podtrzymującego pracę serwera w momencie braku zasilania. W przeciwnym wypadku, po restarcie serwera stan zamka cyfrowego bedzie wyzerowany i alarm się rozbroi.\nPewnym rozwiązaniem jest dodanie selektora, który pamięta stan swoich wejść nawet po zaniku zasilania. Jednak jego pamięć (jak każdego elementu z ołówkiem) jest aktualizowana tylko co 1h.</p>",
  "description_4_1": "<b>Założenia projektu</b><p>Projekt służy do sterowania kotłem, załączanego przekaźnikiem rH-R3S3<ul><li>Ustalenie typów dni tygodnia (dni robocze, weekendy, święta)</li><li>Ustalenie profilu obecności użytkownika (czas pobudki, obecność, nieobecność, czas pójścia spać)</li><li>Ustalenie temperatur dla profilu obecności użytkownika</li></ul></p><p><b>Opis projektu</b><p>Projekt służy do automatycznego załączania/wyłączania przekaźnika rH-R3S3, odpowiedzialnego za pracę kotła po porównaniu temperatury aktualnej z temperaturą zadaną. W pierwszym kroku należy ustalić w <i>Ustawienia użytkownika</i> elementu SX 705, które dni tygodnia będą pracujące, które wchodzą w skład weekendów oraz które są świętami. W kolejnym kroku należy przejść do <i>Ustawienia użytkownika</i> SX 698, gdzie należy zdefiniować odpowiednie przedziały czasowe dla profilu obecności użytkownika.</p><p>Ikony dotykowe na panelu dotykowym służą do ustalenia zadanej temperatury dla określonej pory dnia użytkownika. Aktualny pomiar temperatury jest mierzony za pomocą modułu rH-P1T1, a następnie jest porównywany z odpowiednią temperaturą zadaną. W zależności od wyniku porównania przekaźnik kotła jest załączany lub wyłączany. Aby przekaźnik nie załączał się przy każdej niewielkiej zmianie temperatury, należy w <i>Ustawiania instalatora</i> SX 844 ustawić odpowiednią wartość histerezy. W przypadku, gdy użytkownik opuszcza dom w przedziale czasowym określonym jako nieobecność,  temperatura zostanie ustawiona na zadaną aż do momentu powrotu użytkownika.</p></p>",
  "description_5_1": "<b>Założenia projektu</b><p><ul><li>Co 14 dni napełniamy zbiornik-odstojnik 200 l wody</li><li>Czekamy 48 godzin</li><li>Z akwarium wypompowujemy 200 l wody</li><li>Do akwarium pompujemy zawartość odstojnika</li></ul><p>Czujniki:<ol><li>Czujnik napełnienia odstojnika</li><li>Czujnik napełnienia akwarium do poziomu 200 l</li><li>Czujnik pełnego napełnienia akwarium</li><li>Przycisk do ręcznego wymuszenia cyklu</li></ol></p><p>Elementy wykonawcze:<ol><li>Elektrozawór napełniania odstojnika</li><li>Pompa/elektrozaworów przelewania wody z odstojnika do akwarium</li><li>Pompa/elektrozaworów wylewająca wodę z akwarium</li></ol></p><p>Zabezpieczenia sprzętowe:<ol><li>Rurka przelewowa w odstojniku</li><li>Rurka przelewowa w akwarium</li><li>Wylew z akwarium na poziomie niepozwalającym wypompować więcej niż 210 l wody</li><li>Dobór takich pomp, aby mogły pracować \"na sucho\"</li></ol></p><p>Moduły:<ol type=\"1\"><li>rH-R3S3<ul type=\"disc\"><li>elektrozawór napełniania odstojnika</li><li>pompa/elektrozaworów przelewania wody z odstojnika do akwarium</li><li>pompa/elektrozaworów wylewająca wodę z akwarium</li><li>czujnik pełnego napełnienia akwarium</li><li>czujnik napełnienia odstojnika</li><li>czujnik napełnienia akwarium do poziomu 200 l</li></ul></li><li>rH-S2<ul><li>S1 – przycisk wymuszający proces</li></ul></li></ol></p></p><p><b>Opis projektu</b></p><p>Projekt zgodnie z dobrymi praktykami wykonany jest na dwóch zakładkach (strefach). Na zakładce \"Moduły\" znajduje się moduł rH-R3S3 wraz z kontrolkami do ręcznego wymuszenia sterowania zaworami/pompami i kontrolki pokazujące stan sensorów. Zakładka \"Logika\" zawiera układy generujące sekwencje sterujące.</p><p>Do odliczania czasu 14 dni wykorzystano obiekt SX 701 czas nocny i licznik dwukierunkowy. Gdy licznik jest wyzerowany, sprzężenie poprzez bramkę NOT powoduje wpisanie do niego wartości 14. W ten sposób zostaje odliczany czas i w chwili dojścia do zera na wyjściu licznika pojawia się logiczne '0'. W ten sposób uruchamiany jest generator impulsu sterujący procesem napełniania odstojnika. Gdy zbiornik się napełni, czujnik poziomu skasuje generator, w przeciwnym wypadku po upłynięciu ustawionego czasu (timeout) impuls też się skasuje.</p><p>Impuls napełniający odstojnik ustawia drugi licznik zliczający dwa dni. Po tym czasie wyjście licznika wyzwoli kolejny generator impulsu, który uruchamia pompę opróżniającą akwarium. Zmiana stanu sensora poziomu 200 l lub upłynięcia ustawionego czasu zakończy opróżnianie akwarium. To z kolei spowoduje uruchomienie ostatniego generatora impulsu który poprzez przekaźnik uruchomi pompę przelewającą wodę z odstojnika do akwarium. Podobnie jak poprzednio proces zakończy się, gdy czujnik napełnienia akwarium zmieni stan lub upłynie czas ustawiony w generatorze impulsu.</p><p>Układ nie ma obsługi błędów. Można go przebudować poprzez zastosowanie licznika warunkowego zamiast generatorów impulsu.</p>",
  "description_6_1": "<b>Założenia projektu</b><p>Projekt służy do zablokowania możliwości wyłączenia oświetlenia fizycznym wyłącznikiem, w momencie gdy załączona jest pierwsza scena świetlna.</p><p><p><b>Opis projektu</b></p>W projekcie wykorzystano sterownik scen świetlnych SX 553. Aby załączyć scenę świetlną i przełączać się pomiędzy kolejnymi scenami należy zewrzeć pierwszy styk modułu rH-S4 (Nadajnik czterokanałowy). Wyłączenie oświetlenia następuje po zwarciu drugiego styku modułu rH-S4 tylko w przypadku, gdy wybrana jest scena inna niż pierwsza.</p>",
  "description_7_1": "<b>Założenia projektu</b><p>Projekt służy do zmiany wartości temperatury w zależności od wybranej sceny świetlnej. Regulacja temperatury może odbywać się na dwa sposoby: <ul><li>Poprzez wykorzystanie panelu dotykowego do regulacji wartości temperatury dla danej sceny</li><li>Bez wykorzystania panelu mobilnego, z góry ustalając wartość temperatury dla odpowiednich scen</li></ul></p><p><p><b>Opis projektu</b></p>Wykorzystując panel dotykowy do regulacji temperatury, wyjścia poszczególnych przycisków dotykowych SX 716 w trybie piątym podłączamy do kolejnych wejść multipleksera &mdash; SX 847. Wejście bajtowe multipleksera łączymy z wyjściem bajtowym sterownika SX 553, na którym jest aktualny numer sceny świetlnej. Wyjście multipleksera łączymy z wejściem zadanej temperatury regulatora temperatury SX 650. Do wejśćia temperatury zmierzonej regulatora podłączamy wyjście temperatury modułu rH-P1T1. Następnie w <i>Ustawienia instalatora</i> regulatora SX 650 ustawiamy wartość histerezy aby zapobiec zbyt częstym zmianom wyjścia binarnego regulatora.</p><p>Aby stworzyć układ do refulacji temperatury bez panelu mobilnego, należy wykonać analogiczne czynności jak powyżej, z tą różnicą że zamiast multipleksera zastosować obiekt SX 832 &mdash; dekoder liczby na wyjście binarne. Następnie do jego wyjść podłączyć obiekty SX 841. W <i>Ustawienia instalatora</i> SX 841 należy wybrać wartość temperatury dla stanu logicznego '0' oraz 1. Wyjścia SX 841 należy podłączyć do wejść SX 662 w trybie drugim.</p>",
  "description_8_1": "<b>Założenia projektu</b><p>Projekt służy do płynnej zmiany natężenia i/lub barwy światła w przypadku zastosowania LED RGB.</p><b>Opis projektu</b><p>Do modułu rH-PWM3 należy podłączyć odpowiednie obwody lamp. W <i>Ustawienia użytkownika</i> sterowników SX 553 należy skonfigurować procentową wartość natężenia oświetlenia dla scen świetlnych. Naciśnięcie ikony dotykowej SX 716 na panelu dotykowym skutkuje załączeniem/wyłączeniem oświetlenia. Szybkość załączania kolejnych scen świetlnych należy skonfigurować w <i>Ustawienia instalatora</i> elementów SX 856</p>",
  "description_9_1": "<b>Założenia projektu</b><p>Projekt służy do sekwencyjnego załączania/wyłączania dowolnych sterowników/urządzeń.</p><p><b>Opis projektu</b></p>Za pomocą projektu można sekwencyjnie załączać i wyłączać elementy SX 890 po upływie ustalonego czasu. Zamiast elementów SX 890 można podłączyć wejścia dowolnych modułów lub sterowników. Aby ustawić odpowiednie czasy załączania poszczególnych elementów, należy odpowiednio skonfigurować parametr określony jako <i>Czas impulsu 1</i> w ustawieniach instalatora elementów SX 853.",
  "scheme1": "Pokaż schemat",
  "scheme10": "Pokaż schemat",
  "scheme11": "Pokaż schemat",
  "scheme2": "Pokaż schemat",
  "scheme3": "Pokaż schemat",
  "scheme4": "Pokaż schemat",
  "scheme5": "Pokaż schemat",
  "scheme6": "Pokaż schemat",
  "scheme7": "Pokaż schemat",
  "scheme8": "Pokaż schemat",
  "scheme9": "Pokaż schemat",
  "title_0": "1. Przykłady gotowych projektów",
  "title_01": "2. Najczęstsze błędy podczas tworzenia projektu",
  "title_01_1": "2.1. Niepoprawne połączenie sterownika do ikony dotykowej",
  "title_02_2": "2.2. Niepoprawne połączenie dwóch sterowników",
  "title_1": "1.2. Podlewanie ogrodu",
  "title_10": "1.11. Brama",
  "title_11": "1.12. Oświetlenie ogrodu",
  "title_1_1": "<b>Założenia projektu</b>",
  "title_1_2": "<b>Opis projektu</b>",
  "title_2": "1.3. Sterowanie ściemniaczem przez dwa sterowniki",
  "title_2_1": "<b>Założenia projektu</b>",
  "title_2_2": "<b>Opis projektu</b>",
  "title_3": "1.4. Alarm",
  "title_3_1": "<b>Założenia projektu</b>",
  "title_3_2": "<b>Opis projektu</b>",
  "title_4": "1.5. Sterowanie kotłem",
  "title_5": "1.6. Akwarium",
  "title_6": "1.7. Blokada wyłączenia oświetlenia przy włączonej scenie świetlnej",
  "title_7": "1.8. Regulacja temperatury w zależności od wybranej sceny świetlnej",
  "title_8": "1.9. Pływające światło",
  "title_9": "1.10. Sekwencyjne włączanie i wyłączanie",
  "title_des": "1.1. Import projektu"
}
);