jsonCallback(
{
  "xSX": "PROJECTS",
  "xnazwa1": "EXAMPLES OF COMPLETED PROJECTS",
  "sto": "Document version:",
  "des": "<b>To import the selected project in WiHome Configurator:</b><p>Click <i>Change project</i><img src=\"../../wihome/index/images/en/screen_2_1a.png\"></p><p>Select <i>Folders on the disc</i><img src=\"../../wihome/index/images/en/screen_2_1b.png\"></p><p>Select the desired project from the <i>Drafts</i> list and click <i>Load</i><img src=\"image/des3en.png\"></p>",
  "description_01_1": "To connect the touch icon in slider mode (mode 5) and control the lighting level as well as display the actual value on the icon: <ol><li>Connect the touch icon output with the controller's percentage input</li><li>Connect the module's lighting output (e.g. rH-D1S2) with the touch icon input</li><li>Connect the module's lighting input (e.g. rH-D1S2) with the lighting controller output</li></ol><p>An example of a correct connection:<img src=\"images/550_1_1_ok.png\"><div class=\"norma\">A common error is connection of the touch icon input in the \"slider\" mode directly to the lighting controller output. If these two objects are connected in this way, the project may not function correctly as the current state cannot be read from the dimmer module output.<p>The example below presents an example of the incorrect connection of objects.</p></div><img src=\"images/550_1_1_bad.png\"></p>",
  "description_02_2": "It is incorrect to connect the SX 550 controller lighting output with the SX 553 controller percentage input.<img src=\"images/553_2_2_bad.png\">To control the lighting level correctly, the appropriate system element should be used (e.g. a touch icon). An example of a correct connection is presented below:<img src=\"images/553_2_1_ok.png\">",
  "description_10_1": "<b>Project assumption</b><p><ul><li>Two input signals: gate open and gate closed</li><li>One output signal: gate start/stop</li></ul></p><p><b>Project description</b></p><p>If the gate is closed, the system is at rest. The multivibrators and generator inputs are zeroed. When the gate is at an intermediate state, i.e. moving or is neither fully open or closed, a logical '1' is received at the T2 generator input. When half of the period of this generator elapses, the falling edge at its output causes a start/stop impulse to be generated by the multivibrator to the gate controller. When the gate closes after a full period of generator operation, the impulse to the gate controller is generated again.</p><p>The control sequence for when the gate is open is analogous. Two generators are used so that different times can be set for the state of keeping the gate partially open and fully open. The T2 time should be several seconds longer than twice the period of operation of the gate. The T1 time should be set to be double the time for which the gate should shut by itself from the moment it opens. Using generators instead of a monostable multivibrator eliminates the situation whereby the system freezes when, for example, the closing process was interrupted by the blocking of the photoelectric cell.</p>",
  "description_1_1": "The project assumes that the garden is watered automatically when the following conditions are fulfilled:<ul><li>There has been no rain in the previous 24 hours</li><li>The air temperature hasn't fallen below 18°C in the previous 24 hours</li><li>Rain is not forecast for tomorrow</li><li>Watering takes place for 10 minutes at night</li><li>After detecting a presence, watering is interrupted for 15 minutes</li></ul>",
  "description_11_1": "<b>Project goals</b><p>The project allows management of garden lighting:<ul><li>The lighting comes on automatically after 12:00, when it is \"very dark\"</li><li>The lighting switches off after 22:00</li><li>Optionally, the lighting comes on automatically after 6:00, when it is \"very dark\".</li><li>The lighting can be switched on/off manually with the help of the touch panel</li></ul></p><b>Project description</b><p>To configure the time that the lighting is switched on/off appropriately, use the <i>User settings</i> of the SX 850 elements. The ambient brightness level for which the lighting should be switched on is configured in the <i>User settings</i> of the SX 559 element. Thanks to the use of the switch of the last change, the lighting can be managed using the touch panel. The option of switching on the lighting after 6:00 depending on ambient light levels is available after selecting the SX 718 icon on the touch panel.</p>",
  "description_1_2": "<p>Readings from the SX 555 weather forecasting controller are compared by using the SX 835 digital comparator with the appropriate values, to establish whether it is currently raining or whether rain is forecast for the next day.</p><p>If it is not currently raining, the signal activates the SX 856 impulse generator which is connected to the SX 825 counter. Impulses are generated every 20 minutes and the counter's maximum value is set to 72. Every 24 hour period is counted in this manner and once this value is reached, the counter returns a logical state of '1' at the \"Maximum value\" output.</p><p>The length of time for which the temperature exceeds 18°C is recorded in a similar manner. Temperature measurement is carried out by the rH-P1T1 sensor and the value is sent to the SX 844 comparator.</p><p>The next condition for activation of the sprinkler is an appropriate daylight level. This information is obtained from the appropriate output of the SX 512 object Server found in the <i>System</i> tab. A value of '0' corresponds to the 'very dark' daylight level. After receiving a '0', the SX 832 decoder returns a logical '1' to the appropriate output.</p><p>If the above conditions are satisfied, and if rain is not forecast for tomorrow, the AND gate receives a logical '1' at all inputs and returns a signal to activate the sprinkler (here this is carried out via the rH-R1S1 module).</p><p>In addition, this signal passes through the 805 logic key which, if motion is detected, switches off the sprinkler for 15 minutes from the last detected movement.</p><p>The watering time is measured with the help of the impulse generator + counter system.",
  "description_2_1": "The project is used to manage two lamp circuits:<ul><li>Switching the lamp circuits on and off separately</li><li>Switching all the lamp circuits on and off</li><li>Setting the lighting level for a selected lamp circuit</li><li>Setting the lighting levels for all lamp circuits</li></ul>",
  "description_2_2": "Two rH-D1S2 modules are used in the project for connection of two lamp circuits. Control of the lamps is carried out with the help of a touch panel. <p>To switch on circuit 1 or 2, click on the SX 719 on-off touch icon labelled \"Circuit 1\" or \"Circuit 2\" respectively.</p> <p>To control the lighting level, use the SX 710 touch keys &mdash; the lightbulb touch key in Mode 5.</p><p>Outputs from the SX 550 lighting controllers for Circuits 1 and 2 are transmitted independently to input A of the SX 848 elements.</p> <p>The output from the common SX 550 lighting controller is transmitted in parallel to input B of both SX 848 elements.",
  "description_3_1": "<p>The project presents control of the alarm and blind:</p><p><ul><li>Arming and disarming the mobile panel</li><li>After arming the alarm, the blind is lowered completely</li><li>After disarming the alarm, the blind opens</li><li>The blind can be controlled from a separate panel, independently of the state of the alarm<li>Control of the blind by using the keys connected to the rH-TSR1S2 module</li></ul>",
  "description_3_2": "Arming the alarm takes place via the touch panel. The default password is 1234 and it is set in the <i>User settings</i> of the SX 829 digital lock module. The blinds are served by the rH-TSR1S2 module which is connected to the SX 760 controller. The blind can be controlled via the touch panel or the keys connected to the rH-TSR1S2 module contacts.</p><p>How the blind behaves after arming or disarming the alarm is defined in the <i>User settings</i>. The default is for the blind to close after arming the alarm, and to open when it is disarmed. The behaviour of the blind after an intrusion can also be set in the <i>Installer settings</i> &mdash; the default is for the blind position to remain unchanged.</p><p>A rH-P1 motion sensor can also be found on the project in alarm mode. The sensor cooperates implicitly (without connection) with the alarm controller.</p><p><b>WARNING:</b><br>Remember to use an UPS to maintain server operation in the event of a power failure as otherwise, the digital lock will be reset and the alarm disarmed when the server restarts.\nOne solution is to add a selector that recalls the state of its inputs even if the power fails. However, its memory is updated only every 1 hour (as for all elements with a pencil symbol).</p>",
  "description_4_1": "<b>Project assumptions</b><p>The project controls the boiler, which is connected with a rH-R3S3 relay<ul><li>Setting the types of days of the week (working days, weekends, holidays)</li><li>Setting the user presence profile (wake up time, presence, lack of presence, going to bed)</li><li>Setting the temperatures for periods when the user is present</li></ul></p><p><b>Project description</b><p>The project is used to turn the rH-R3S3 relay on or off automatically. The relay is responsible for the operation of the boiler after comparison of the desired and current temperatures. The first step is to set which days of the week will be working days in the <i>User settings</i> of the SX 705, which days will be weekends and which are holidays. The next step is to go to the <i>User settings</i> of the SX 698 element, and set the appropriate time periods when the users will be present.</p><p>The icons on the touch panel are used to set the target temperature for the user at the given time of day. The current temperature is measured with the help of the rH-P1T1 module and it is then compared with the relevant target temperature. Depending on the results of the comparison, the boiler relay is switched on or off. To prevent the relay from switched on for every small temperature change, set the appropriate hysteresis value in the SX 844 <i>Installer settings</i>. In the event that the user leaves the building within the period defined as occupied, the temperature will be set to the desired temperature until the return of the user.</p></p>",
  "description_5_1": "<b>Project assumptions</b><p><ul><li>The storage/settlement tank is filled every 14 days with 200 litres of water</li><li>A period of 48 hours elapses</li><li>200 litres of water is pumped out of the aquarium</li><li>The contents of the storage/settlement tank are pumped into the aquarium</li></ul><p>Sensors:<ol><li>Settlement tank water level sensor</li><li>The sensor fills the aquarium to a level of 200 litres</li><li>Full aquarium sensor</li><li>Manual override switch</li></ol></p><p>Installation elements:<ol><li>Settlement tank filling solenoid</li><li>Pump/solenoid valve for filling the aquarium with water from the tank</li><li>Pump/solenoid valve for emptying the aquarium</li></ol></p><p>Safety equipment:<ol><li>Settlement tank overflow pipe</li><li>Aquarium overflow pipe</li><li>Aquarium outflow that prevents pumping out of more than 210 litres of water</li><li>Selection of pumps that can operate \"dry\"</li></ol></p><p>Modules:<ol type=\"1\"><li>rH-R3S3<ul type=\"disc\"><li>solenoid valve for filling the settlement tank</li><li>pump/solenoid valve for filling the aquarium from the settlement tank</li><li>pump/solenoid valve for emptying the aquarium</li><li>full aquarium sensor</li><li>full settlement tank sensor</li><li>aquarium -200 litre level sensor</li></ul></li><li>rH-S2<ul><li>S1 - manual override switch</li></ul></li></ol></p></p><p><b>Project description</b></p><p>In agreement with good practice, the project is created on two tabs (zones). The rH-R3S3 module is located on the \"Module\" tab, together with the indicators for the override that allows manual control of the valves/pumps, as well as the sensor state indicators. The \"Logic\" tab includes the systems that generate the control sequences.</p><p>The SX 701 night time object and two-way counter are used to count 14 days xxx. When the counter is reset, the coupling though the NOT gate assigns it a value of 14 which allows measurement of time is measured. When the counter reaches 0, a logical '0' is returned to the counter output and the impulse generator that controls the process of filling the settlement tank is activated. When the tank is filled, the level sensor cancels the generator, and the impulse is also cancelled after the set period of time has elapsed (timeout).</p><p>The impulse that causes the settlement tank to be filled activates another impulse generator that in turn activates the pump that empties the aquarium. Emptying of the aquarium stops when the state of the 200 litre sensor changes, or after the set period of time has elapsed. This, in turn, activates the final impulse generator which, via a relay, activates the pump that transfers water from the settlement tank to the aquarium. As before, the process ends when the full aquarium sensor changes state or the period of time set in the impulse generator elapses.</p><p>The system does not handle errors. It can be rebuilt by using a conditional counter instead of impulse generators.</p>",
  "description_6_1": "<b>Project assumptions</b><p>The project prevents the possibility of the lighting to be switched off via the physical switch at the moment when the first lighting scene is switched on.</p><p><p><b>Project description</b></p>The project uses the SX 553 lighting scene controller. To switch on the lighting scene and switch between subsequent scenes, close the first contact of the rH-S4 module (Four channel transmitter). Switching off of the lighting occurs after the second contact of the rH-S4 is closed only when the selected scene is different to the first.",
  "description_7_1": "<b>Project assumptions</b><p>The project allows temperature values to be changed depending on the selected lighting scene. Temperature control can occur in two ways: <ul><li>By using the touch panel to control the temperature values for a given scene</li><li>Without using the mobile panel, by manually setting the temperature values for the relevant scenes</li></ul></p><p><p><b>Project description</b></p>Using the touch panel to regulate temperature, connect the outputs of individual touch switches of the SX 716 in 5th mode, to the sequential outputs of the SX 847 multiplexer. Then connect the multiplexer byte input to the SX 553 controller's byte output which is returning the current lighting scene. Connect the multiplexer output to the set temperature input of the SX 650 temperature controller. Connect the temperature output of the rH-P1T1 module to the controller's desired temperature input. To prevent the binary output of the controller from changing too frequently, the hysteresis value should be set in the SX 650 controller's <i>Installer settings</i>.</p><p>To allow infilling of the temperature without the mobile panel, repeat the actions above but instead of the multiplexer, use the SX 832 object - a number decoder for the binary output. Then connect SX 841 objects to its outputs. In the SX 841 <i>Installer settings</i> select the temperature values for the '0' and '1' logic states. Connect the SX 841 outputs to the SX 662 inputs in second mode.</p>",
  "description_8_1": "<b>Project assumptions</b><p>The project allows dynamic change of the  brightness and/or colour of the lighting when using LED RGB. </p><b>Project description</b><p>Connect the appropriate lamp circuits to the rH-PWM3 module. In the SX 553 controller <i>User settings</i>, configure the percentage value of the lighting for the lighting scenes. Pressing the icon on the SX 716 touch panel will switch the lighting on and off. The speed at which subsequent lighting scenes are activated should be configures in the <i>Installer settings</i> of the SX 856 elements</p>",
  "description_9_1": "<b>Project assumptions</b><p>The project allows the sequential switching on and off of any controller or device.</p><p><b>Project description</b></p>The project allows the sequential switching on or off of the SX 890 elements after a set period of time has elapsed. Instead of the SX 890 elements, the inputs of any modules or controllers can be connected. To set the time when specific elements are to be switched on, configure the <i>Impulse 1</i> parameter in the SX 853 element installer settings.",
  "scheme1": "Display schematic",
  "scheme10": "Display schematic",
  "scheme11": "Display schematic",
  "scheme2": "Display schematic",
  "scheme3": "Display schematic",
  "scheme4": "Display schematic",
  "scheme5": "Display schematic",
  "scheme6": "Display schematic",
  "scheme7": "Display schematic",
  "scheme8": "Display schematic",
  "scheme9": "Display schematic",
  "title_0": "1. Examples of completed projects",
  "title_01": "2. Common mistakes in creating a project",
  "title_01_1": "2.1.  Incorrect connection of the controller to the touch icon",
  "title_02_2": "2.2. Incorrect connection of two controllers",
  "title_1": "1.2. Garden watering",
  "title_10": "1.11. Gate",
  "title_11": "1.12. Garden lighting",
  "title_1_1": "<b>Project assumptions</b>",
  "title_1_2": "<b>Project description</b>",
  "title_2": "1.3. Control of the dimmer with two controllers",
  "title_2_1": "<b>Project assumptions</b>",
  "title_2_2": "<b>Project description</b>",
  "title_3": "1.4. Alarm",
  "title_3_1": "<b>Project assumptions</b>",
  "title_3_2": "<b>Project description</b>",
  "title_4": "1.5. Boiler control",
  "title_5": "1.6. Aquarium",
  "title_6": "1.7. Disable switching on of the lighting when the lighting scene is switched off",
  "title_7": "1.8. Control the temperature depending on the selected lighting scene",
  "title_8": "1.9. Floating light",
  "title_9": "1.10. Sequential switching on and off",
  "title_des": "1.1. Import of a project"
}
);